<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0c84ae3aff54afbd8463b7279292175761abe538821b136606acdda4d9e32058","plan_job_ref":"Job Terraform Plan #7 at https://github.com/cal-itp/gtfs.calitp.org/actions/runs/15426720263","plan_out_hash":"40f952aeba53f6034cddea490be36a5f28a672f6726ac1faa6734bfd3efadba7","plan_hash":"9b4c72aab873c6b745ed84e351794d97bfde1f7be6a99516b5a5b7d60290e4e8","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 42 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/ArtesiaGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/ArtesiaGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/ArtesiaGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/ArvinGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/ArvinGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/ArvinGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/BayAreaFerriesAngelIslandFerryGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/BayAreaFerriesAngelIslandFerryGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/BayAreaFerriesAngelIslandFerryGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/BayAreaFerriesBlueAndGoldFleetGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/BayAreaFerriesBlueAndGoldFleetGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/BayAreaFerriesBlueAndGoldFleetGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/BayAreaFerriesHornblowerAlcatrazCruisesGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/BayAreaFerriesHornblowerAlcatrazCruisesGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/BayAreaFerriesHornblowerAlcatrazCruisesGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/BellflowerGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/BellflowerGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/BellflowerGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/CamarilloGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/CamarilloGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/CamarilloGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/CityOfRidgecrestGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/CityOfRidgecrestGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/CityOfRidgecrestGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/CleanAirExpressFaresv2.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/CleanAirExpressFaresv2.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/CleanAirExpressFaresv2.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/EasternSierraBishopLonePineFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/EasternSierraBishopLonePineFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/EasternSierraBishopLonePineFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/GlennGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/GlennGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/GlennGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/GuadalupeFlyerGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/GuadalupeFlyerGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/GuadalupeFlyerGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/GuadalupeFlyerParatransitFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/GuadalupeFlyerParatransitFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/GuadalupeFlyerParatransitFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/HavasuLandingFerryGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/HavasuLandingFerryGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/HavasuLandingFerryGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/HumboldtTransitAuthorityDialARideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/HumboldtTransitAuthorityDialARideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/HumboldtTransitAuthorityDialARideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/InglewoodShuttleGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/InglewoodShuttleGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/InglewoodShuttleGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/LagunaBeachTransitLocalFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/LagunaBeachTransitLocalFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/LagunaBeachTransitLocalFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/LassenRuralBusandDialARideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/LassenRuralBusandDialARideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/LassenRuralBusandDialARideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/MOVEStanislausVetsvanFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/MOVEStanislausVetsvanFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/MOVEStanislausVetsvanFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/MantecaTransitParatransitFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/MantecaTransitParatransitFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/MantecaTransitParatransitFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/MaywoodGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/MaywoodGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/MaywoodGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/PlacerCountyDialARideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/PlacerCountyDialARideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/PlacerCountyDialARideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/RedwoodCoastDelNorteFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/RedwoodCoastDelNorteFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/RedwoodCoastDelNorteFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/SanBenitoCountyExpressDialARideParatransitOnDemandFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/SanBenitoCountyExpressDialARideParatransitOnDemandFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/SanBenitoCountyExpressDialARideParatransitOnDemandFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/SanJoaquinRTDDialARideandVanGoFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/SanJoaquinRTDDialARideandVanGoFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/SanJoaquinRTDDialARideandVanGoFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/SanJuanCapistranoGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/SanJuanCapistranoGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/SanJuanCapistranoGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/StanRTAModestoNewmanOakdalePattersomandRiverbankFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/StanRTAModestoNewmanOakdalePattersomandRiverbankFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/StanRTAModestoNewmanOakdalePattersomandRiverbankFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/TaftGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/TaftGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/TaftGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/TahoeTruckeeRegionalTransportationTARTConnectDialARidePlacerTARTParatransitFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/TahoeTruckeeRegionalTransportationTARTConnectDialARidePlacerTARTParatransitFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/TahoeTruckeeRegionalTransportationTARTConnectDialARidePlacerTARTParatransitFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/ThousandOaksDialARideParatransitandConnectFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/ThousandOaksDialARideParatransitandConnectFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/ThousandOaksDialARideParatransitandConnectFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/TracyTRACERPlusandParatransitFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/TracyTRACERPlusandParatransitFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/TracyTRACERPlusandParatransitFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/TulareCountyAreaTransitandDialARideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/TulareCountyAreaTransitandDialARideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/TulareCountyAreaTransitandDialARideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/TurlockTransitDialARideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/TurlockTransitDialARideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/TurlockTransitDialARideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/UnionCityParatransitFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/UnionCityParatransitFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/UnionCityParatransitFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/ValleyExpressDialARideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/ValleyExpressDialARideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/ValleyExpressDialARideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/WascoDialaRideFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/WascoDialaRideFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/WascoDialaRideFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/WestBerkeleyShuttleGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/WestBerkeleyShuttleGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/WestBerkeleyShuttleGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/WestCATSeniorDialARideandParatransitFlex.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/WestCATSeniorDialARideandParatransitFlex.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/WestCATSeniorDialARideandParatransitFlex.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/YurokGTFS.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "gtfs_files/YurokGTFS.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/gtfs_files/YurokGTFS.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["sha.txt"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "FGRSrg==" -> (known after apply)
!~      detect_md5hash      = "P36vr9g9msjONDk9U49KJA==" -> "different hash"
!~      generation          = 1748980510958010 -> (known after apply)
        id                  = "calitp-gtfs-sha.txt"
!~      md5hash             = "P36vr9g9msjONDk9U49KJA==" -> (known after apply)
        name                = "sha.txt"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.gtfs-calitp-org["test/TestFlex1.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "test/TestFlex1.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/test/TestFlex1.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["test/TestFlex2.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "test/TestFlex2.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/test/TestFlex2.zip"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["test/TestFlex3.zip"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "test/TestFlex3.zip"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/test/TestFlex3.zip"
+       storage_class  = (known after apply)
    }

Plan: 42 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #7](https://github.com/cal-itp/gtfs.calitp.org/actions/runs/15426720263)